In [1]:
import pandas as pd

In [3]:
sr1=pd.Series([1,2,3,4])
sr2=pd.Series([1,2,3,4])

In [5]:
pd.concat([sr1,sr2])

0    1
1    2
2    3
3    4
0    1
1    2
2    3
3    4
dtype: int64

In [14]:
d1=pd.DataFrame({'A':[1,2],'B':[1,5]})
d2=pd.DataFrame({'A':[1,2,3,4],'B':[1,5,3,6]})

In [15]:
pd.concat([d1,d2])

   A  B
0  1  1
1  2  5
0  1  1
1  2  5
2  3  3
3  4  6

In [16]:
pd.concat([d1,d2],axis=1)

     A    B  A  B
0  1.0  1.0  1  1
1  2.0  5.0  2  5
2  NaN  NaN  3  3
3  NaN  NaN  4  6

In [17]:
pd.concat([d1,d2],join='inner')

   A  B
0  1  1
1  2  5
0  1  1
1  2  5
2  3  3
3  4  6

In [18]:
pd.concat([d1,d2],join='inner',axis=1)

   A  B  A  B
0  1  1  1  1
1  2  5  2  5

In [19]:
pd.concat([d1,d2],join='outer',axis=1)

     A    B  A  B
0  1.0  1.0  1  1
1  2.0  5.0  2  5
2  NaN  NaN  3  3
3  NaN  NaN  4  6

In [21]:
pd.concat([d1,d2],join='outer',axis=1,keys=['name','id'])

  name      id
     A    B  A  B
0  1.0  1.0  1  1
1  2.0  5.0  2  5
2  NaN  NaN  3  3
3  NaN  NaN  4  6

In [22]:
pd.concat([d1,d2],join='outer',keys=['name','id'])

        A  B
name 0  1  1
     1  2  5
id   0  1  1
     1  2  5
     2  3  3
     3  4  6